Hi @robzr 👋  Thank you for raising this and sorry you ran into trouble there. This happens to be a documentation bug which we can get resolved, but changing the argument from `base_rfc3339` to `rfc3339` matches the underlying implementation. e.g.

```terraform
terraform {
  required_providers {
    time = {
      source  = "hashicorp/time"
      version = "0.7.1"
    }
  }
}

provider "time" {}

resource "time_rotating" "this" {
  rfc3339       = "2021-05-04T17:42:13Z"
  rotation_days = 1
}
```

```console
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # time_rotating.this will be created
  + resource "time_rotating" "this" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = "2021-05-04T17:42:13Z"
      + rotation_days    = 1
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

time_rotating.this: Creating...
time_rotating.this: Creation complete after 0s [id=2021-05-04T17:42:13Z]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```